VPro/src/Catalogs/ServiceContractsTariffPlans/ServiceContractsTariffPlans.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ServiceContractsTariffPlans</name>
  <attributes>
    <name>UnplannedCostsIncludeInInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsProhibit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsPresentationInInvoice</name>
    <type>
      <types>CatalogRef.ProductsAndServices</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsPricingMethod</name>
    <type>
      <types>EnumRef.BillingCostsPricingMethod</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsMarkup</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedCostsFixedPrice</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedItemsIncludeInInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedItemsProhibit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UnplannedItemsPresentationInInvoice</name>
    <type>
      <types>CatalogRef.ProductsAndServices</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CostAccounting</name>
    <attributes>
      <name>CostsItem</name>
      <type>
        <types>ChartOfAccountsRef.Managerial</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeInInvoice</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PricingMethod</name>
      <type>
        <types>EnumRef.BillingCostsPricingMethod</types>
      </type>
    </attributes>
    <attributes>
      <name>PresentationInAccount</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>AddPeriodToContent</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProductsAndServicesAccounting</name>
    <attributes>
      <name>ProductsAndServices</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>CHARACTERISTIC</name>
      <type>
        <types>CatalogRef.ProductsAndServicesCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>IncludeInInvoice</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PricingMethod</name>
      <type>
        <types>EnumRef.BillingProductsAndServicesPricingMethod</types>
      </type>
    </attributes>
    <attributes>
      <name>PresentationInAccount</name>
      <type>
        <types>CatalogRef.ProductsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>AddPeriodToContent</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Enums/BillingCostsPricingMethod/BillingCostsPricingMethod.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BillingCostsPricingMethod</name>
  <enumValues>
    <name>ByCost</name>
  </enumValues>
  <enumValues>
    <name>ByCostWithMarkup</name>
  </enumValues>
  <enumValues>
    <name>FixedValue</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/BillingProductsAndServicesPricingMethod/BillingProductsAndServicesPricingMethod.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BillingProductsAndServicesPricingMethod</name>
  <enumValues>
    <name>ByContractPriceKind</name>
  </enumValues>
  <enumValues>
    <name>FixedValue</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/ServiceContractsTariffPlans/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If UnplannedCostsIncludeInInvoice Then
		CheckedAttributes.Add("UnplannedCostsPresentationInInvoice");
		
		If UnplannedCostsPricingMethod = Enums.BillingCostsPricingMethod.FixedValue Then
			CheckedAttributes.Add("UnplannedCostsFixedPrice");
		ElsIf UnplannedCostsPricingMethod = Enums.BillingCostsPricingMethod.ByCostWithMarkup Then
			CheckedAttributes.Add("UnplannedCostsMarkup");
		EndIf;
	EndIf;
	
	For Each Str In ProductsAndServicesAccounting Do
		If Str.PricingMethod = Enums.BillingProductsAndServicesPricingMethod.FixedValue
			And Not ValueIsFilled(Str.Price) Then
			
			MessageText = StrTemplate(
				NStr("en='The ""Price"" column in the %1 line of the ""Products and services"" list is not filled.';ru='Не заполнена колонка ""Цена"" в строке %1 списка ""Номенклатура"".';vi='Chưa điền cột ""Đơn giá"" trong dòng %1 của danh sách ""Mặt hàng"".'"),
				Str.LineNumber
			);
			
			SmallBusinessServer.ShowMessageAboutError(
				ThisObject,
				MessageText,
				"ProductsAndServicesAccounting",
				Str.LineNumber,
				"PricePresentation",
				Cancel
			);
		EndIf;
	EndDo;
	
	For Each Str In CostAccounting Do
		
		If Str.PricingMethod = Enums.BillingCostsPricingMethod.FixedValue
			And Not ValueIsFilled(Str.Price) Then
			
			MessageText = StrTemplate(
				NStr("en='The ""Price"" column in the %1 line of the ""Costs"" list is not filled.';ru='Не заполнена колонка ""Цена"" в строке %1 списка ""Затраты"".';vi='Chưa điền cột ""Đơn giá"" trong dòng %1 của danh sách ""Chi phí"".'"),
				Str.LineNumber
			);
			
			SmallBusinessServer.ShowMessageAboutError(
				ThisObject,
				MessageText,
				"CostAccounting",
				Str.LineNumber,
				"PricePresentation",
				Cancel
			);
		EndIf;
		
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
